alexian79/qemu/hw/arm/stm32g4/stm32g4_i2c1.c
/* stm32g4_i2c1.c */

#include "qemu/osdep.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "include/hw/arm/stm32g4/stm32g4_i2c1.h"
#include "migration/vmstate.h"

#define STM32G4_I2C1_MMIO TYPE_STM32G4_I2C1 "_mmio"
#define STM32G4_I2C1_MMIO_SIZE 0x2C

static uint64_t stm32g4_i2c1_mmio_read(void *opaque, hwaddr offset,
                                       unsigned size)
{
    STM32G4I2C1State *s = STM32G4_I2C1(opaque);
    uint64_t ret = 0;

    switch (offset) {
    case 0x00 ... 0x03:
        /* CR1, Control register 1 */
        ret = s->cr1;
        break;

    case 0x04 ... 0x07:
        /* CR2, Control register 2 */
        ret = s->cr2;
        break;

    case 0x08 ... 0x0B:
        /* OAR1, Own address register 1 */
        ret = s->oar1;
        break;

    case 0x0C ... 0x0F:
        /* OAR2, Own address register 2 */
        ret = s->oar2;
        break;

    case 0x10 ... 0x13:
        /* TIMINGR, Timing register */
        ret = s->timingr;
        break;

    case 0x14 ... 0x17:
        /* TIMEOUTR, Status register 1 */
        ret = s->timeoutr;
        break;

    case 0x18 ... 0x1B:
        /* ISR, Interrupt and Status register */
        ret = s->isr;
        break;

    case 0x1C ... 0x1F:
        /* ICR, Interrupt clear register */
        ret = s->icr;
        break;

    case 0x20 ... 0x23:
        /* PECR, PEC register */
        ret = s->pecr;
        break;

    case 0x24 ... 0x27:
        /* RXDR, Receive data register */
        ret = s->rxdr;
        break;

    case 0x28 ... 0x2B:
        /* TXDR, Transmit data register */
        ret = s->txdr;
        break;

    default:
        printf("%s: unimplemented read from 0x%" HWADDR_PRIx ", size %d\n",
               __func__, offset, size);
        break;
    }

    return ret;
}

static void stm32g4_i2c1_mmio_write(void *opaque, hwaddr offset, uint64_t value,
                                    unsigned size)
{
    STM32G4I2C1State *s = STM32G4_I2C1(opaque);

    switch (offset) {
    case 0x00 ... 0x03:
        /* CR1, Control register 1 */
        s->cr1 = value;
        break;

    case 0x04 ... 0x07:
        /* CR2, Control register 2 */
        s->cr2 = value;
        break;

    case 0x08 ... 0x0B:
        /* OAR1, Own address register 1 */
        s->oar1 = value;
        break;

    case 0x0C ... 0x0F:
        /* OAR2, Own address register 2 */
        s->oar2 = value;
        break;

    case 0x10 ... 0x13:
        /* TIMINGR, Timing register */
        s->timingr = value;
        break;

    case 0x14 ... 0x17:
        /* TIMEOUTR, Status register 1 */
        s->timeoutr = value;
        break;

    case 0x18 ... 0x1B:
        /* ISR, Interrupt and Status register */
        s->isr = value;
        break;

    case 0x1C ... 0x1F:
        /* ICR, Interrupt clear register */
        s->icr = value;
        break;

    case 0x20 ... 0x23:
        /* PECR, PEC register */
        s->pecr = value;
        break;

    case 0x24 ... 0x27:
        /* RXDR, Receive data register */
        s->rxdr = value;
        break;

    case 0x28 ... 0x2B:
        /* TXDR, Transmit data register */
        s->txdr = value;
        break;

    default:
        printf("%s: unimplemented write to 0x%" HWADDR_PRIx ", size %d, "
               "value 0x%" PRIx64 "\n", __func__, offset, size, value);
        break;
    }
}

static const MemoryRegionOps stm32g4_i2c1_mmio_ops = {
    .read = stm32g4_i2c1_mmio_read,
    .write = stm32g4_i2c1_mmio_write,
    .impl = {
        .max_access_size = 4
    }
};

static void stm32g4_i2c1_instance_init(Object *obj)
{
    STM32G4I2C1State *s = STM32G4_I2C1(obj);

    memory_region_init_io(&s->mmio, obj, &stm32g4_i2c1_mmio_ops, s,
                          STM32G4_I2C1_MMIO, STM32G4_I2C1_MMIO_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);
}

static void stm32g4_i2c1_realize(DeviceState *dev, Error **errp)
{
    __attribute__((unused)) STM32G4I2C1State *s = STM32G4_I2C1(dev);
}

static void stm32g4_i2c1_reset(DeviceState *dev)
{
    STM32G4I2C1State *s = STM32G4_I2C1(dev);

    s->cr1 = 0x00000000;
    s->cr2 = 0x00000000;
    s->oar1 = 0x00000000;
    s->oar2 = 0x00000000;
    s->timingr = 0x00000000;
    s->timeoutr = 0x00000000;
    s->isr = 0x00000001;
    s->icr = 0x00000000;
    s->pecr = 0x00000000;
    s->rxdr = 0x00000000;
    s->txdr = 0x00000000;
}

static void stm32g4_i2c1_unrealize(DeviceState *dev, Error **errp)
{
    __attribute__((unused)) STM32G4I2C1State *s = STM32G4_I2C1(dev);
}

static Property stm32g4_i2c1_properties[] = {
    DEFINE_PROP_END_OF_LIST()
};

static const VMStateDescription vmstate_stm32g4_i2c1 = {
    .name = "stm32g4_i2c1",
    .version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_UINT32(cr1, STM32G4I2C1State),
        VMSTATE_UINT32(cr2, STM32G4I2C1State),
        VMSTATE_UINT32(oar1, STM32G4I2C1State),
        VMSTATE_UINT32(oar2, STM32G4I2C1State),
        VMSTATE_UINT32(timingr, STM32G4I2C1State),
        VMSTATE_UINT32(timeoutr, STM32G4I2C1State),
        VMSTATE_UINT32(isr, STM32G4I2C1State),
        VMSTATE_UINT32(icr, STM32G4I2C1State),
        VMSTATE_UINT32(pecr, STM32G4I2C1State),
        VMSTATE_UINT32(rxdr, STM32G4I2C1State),
        VMSTATE_UINT32(txdr, STM32G4I2C1State),
        VMSTATE_END_OF_LIST()
    }
};

static void stm32g4_i2c1_class_init(ObjectClass *oc, void *opaque)
{
    DeviceClass *dc = DEVICE_CLASS(oc);

    dc->realize   = stm32g4_i2c1_realize;
    dc->reset     = stm32g4_i2c1_reset;
    dc->unrealize = stm32g4_i2c1_unrealize;
    dc->vmsd      = &vmstate_stm32g4_i2c1;
    device_class_set_props(dc, stm32g4_i2c1_properties);
}

static TypeInfo stm32g4_i2c1_info = {
    .name          = TYPE_STM32G4_I2C1,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32G4I2C1State),
    .instance_init = stm32g4_i2c1_instance_init,
    .class_init    = stm32g4_i2c1_class_init
};

static void stm32g4_i2c1_register_types(void)
{
    type_register_static(&stm32g4_i2c1_info);
}

type_init(stm32g4_i2c1_register_types)
